Revit 2015 API
Definitions.Create Method
Creates a new parameter definition.
Overload List
Name | Description
Create(ExternalDefinitonCreationOptions)
Creates a new parameter definition using specified options.
Create(String, ParameterType) |  Obsolete.
Creates a new parameter definition using name and type.
Create(String, ParameterType, Boolean) |  Obsolete.
Creates a new parameter definition using name, type and visibility.
Create(String, ParameterType, Boolean, Guid) |  Obsolete.
Creates a new parameter definition using name, type, visibility and a specified Guid.
See Also
Definitions Class
Definitions Members
Autodesk.Revit.DB Namespace